ysst/0/gammaInt
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      gammaInt;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Intermittency for the Menter et al. (2015) one-equation gamma model.
// Dimensionless, 1 in the freestream (fully turbulent), transported by the
// model.  There is NO ReThetat field -- that belongs to the 4-equation
// Langtry-Menter model (kOmegaSSTLM), not to gammaSST.

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 1;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           $internalField;
    }

    outlet
    {
        type            zeroGradient;
    }

    airfoil
    {
        type            zeroGradient;
    }

    sides
    {
        type            empty;
    }
}

// ************************************************************************* //
